{"/test/":{"data":{"":"","how-to-get-started#How to get started":"How to get started\rClone the Repository:\nyou should start by cloning the repository to their local machine:\ngit clone https://github.com/mora-bprs/mora-bprs.github.io.git\rNavigate to the Hugo Site Directory:\nOnce cloned, you should navigate to the directory where the Hugo site is located:\ncd mora-bprs.github.io\rInstall Hugo:\nYou need to have Hugo installed on their local machine. They can follow the installation instructions provided on the official Hugo website. Start Editing the Site:\nRefer to this hugo theme documentation to edit the pages. You can start editing the Hugo site by modifying the content files located in the content directory. They can use Markdown syntax to write content and make changes as needed. first create a folder with the slug name in the content folder, then create an index.md file in that folder and write the content in it.\ntemplate for index.md file:\n--- title: \"Title of the page\" date: 2024-03-03 authors: - name: imfing link: https://go.io tags: - Markdown - Example - Guide draft: false --- ## Sample Markdown content Here write the content of the page in markdown syntax.\rPreview Changes Locally:\nTo preview their changes locally, you can run the Hugo development server: hugo server -D\rThis command starts a local web server, and you can view the site in their web browser at http://localhost:1313.\nGenerate the changes locally:\nTo generate the changes locally, you can run the Hugo command: hugo --destination docs\rThis command generates the static files in the docs directory.\nCommit Changes to the “dev” Branch:\nCreate a branch named dev when you run this for the first time.\ngit checkout -b dev\rIf this is not your first time working with dev branch do the following.\nAfter making changes, you should commit their changes to the “dev” branch:\ngit checkout dev git add . git commit -m \"Description of changes made\" git push origin dev"},"title":"How to get started"}}